import { Component, OnInit, ViewEncapsulation } from '@angular/core';
import { LoaderService } from '../../shared/components/loader/loader.service';

@Component({
  selector: 'app-quality',
  templateUrl: './quality.component.html',
  styleUrls: ['./quality.component.css'],
  encapsulation: ViewEncapsulation.None
})
export class QualityComponent implements OnInit {
  data;
  teamData;
  constructor(private loader: LoaderService) { }

  ngOnInit(): void {
     
    this.loader.showLoader();
    setTimeout(() => {
      this.loader.hideLoader();
    }, 2500);
    this.data= [
      {
        img: '../../../../../assets/images/quality/qualityImg1.jpg',
        primaryTitle: 'أولاً',
        secondryTitle: 'الجودة الشاملة في التعليم',
        discription: `
        حظيت الجودة الشاملة بجانب كبير من هذا الاهتمام إلى الحد الذي جعل بعض المفكرين يطلقون على هذا العصر عصر الجودة، باعتبارها إحدى الركائز الأساسية لنموذج الإدارة التربوية الجديدة الذي تولد لمسايرة المتغيرات الهائلة على كافة الأصعدة الاقتصادية والسياسية والاجتماعية والتربوية والتكنولوجية خاصة، ومحاولة التكيف معها، فأصبح المجتمع العالمي ينظر إلى الجودة الشاملة والإصلاح التربوي باعتبارهما وجهين لعملة واحدة.
        والجودة في التعليم مرتبطة بعمليتي التعلم والتعليم ، وكذلك بالإدارة، وذلك من أجل ربط التعليم بحاجات المجتمع ، وإحداث تغير تربوي هادف ، وبناء وتنمية ملكة الإبداع عند المتعلمين ،ويحدث التعلم عندما يحدث تفاعل بين المتعلم وبيئته ، ونحن نعرف أن التعلم قد حدث عندما نلاحظ أن سلوك المتعلم قد تعدل ، ودورنا نحن أن نتيح الفرصة لحدوث التفاعل كي يحدث التعلم، وهذا يعني توفير كل الشروط والبيئة الصالحة للتعلم ، مما يستوجب وضع معايير للعمليات ، بما يشمل نظام محدد للتأكد من جودة التعليم.
>والجودة في التعليم مرتبطة بعمليتي التعلم والتعليم ، وكذلك بالإدارة، وذلك من أجل ربط التعليم بحاجات المجتمع ، وإحداث تغير تربوي هادف ، وبناء وتنمية ملكة الإبداع عند المتعلمين ،ويحدث التعلم عندما يحدث تفاعل بين المتعلم وبيئته ، ونحن نعرف أن التعلم قد حدث عندما نلاحظ أن سلوك المتعلم قد تعدل ، ودورنا نحن أن نتيح الفرصة لحدوث التفاعل كي يحدث التعلم، وهذا يعني توفير كل الشروط والبيئة الصالحة للتعلم ، مما يستوجب وضع معايير للعمليات ، بما يشمل نظام محدد للتأكد من جودة التعليم.
        `,
      },
      {
        img: '../../../../../assets/images/quality/qualityImg2.jpg',
        primaryTitle: 'ثانياً',
        secondryTitle: ' إدارة الجودة الشاملة في مدارس طلائع المبدعين الأهلية',
        discription: `
        أنشئت مدارس طلائع المبدعين الأهلية في عام 1423 هـ محددة الهدف نحو تأسيس قوي للصفوف الأولية وبفكر عصري متجدد من مؤسسها الخبير التربوي الأستاذ / عوض بن عواض الزائدي ، وبنجاح هذا القسم واستمراراً لمسيرة نجاح العملية التعليمية داخل المدارس بإشراف عام من المؤسس وبإدارة من مديرها المتميز الأستاذ / طارق بن عوض الزائدي استكملت جميع المراحل في عام 1434 هـ وكان القلب النابض لهذا النجاح مدير الإشراف والتطوير التربوي المتميز المستشار / عدنان بن عوض الزائدي 
استمراراً للتميز والحفاظ عليه داخل المدارس في جميع مجالاتها ( التعليمية والإدارية ) تم إنشاء قسم لإدارة الجودة الشاملة بالمدارس في عام 1437 هـ وذلك لتصميم وتقويم وتحسين جميع العمليات داخل المدارس، متوجة بالمبادرات والبرامج الإبداعية التي ترقى في تجويد العملية التعليمية . ومع انطلاق رؤية المملكة في 2030 تسعى إدارة الجودة الشاملة بالمدارس في تحقيق أعلى جودة لها من خلال المشاركات في الجوائز الإقليمية والعالمية والتي تهدف إلى تحقيق قياس عالمي ذي أثر مثمر على جميع منسوبيها .
  `,
      },
      {
        img: '../../../../../assets/images/quality/qualityImg3.jpg',
        primaryTitle: 'ثالثاً',
        secondryTitle: 'إنجازات إدارة الجودة الشاملة بالمدارس منذ نشأتها',
        discription: `على أولياء الأمور المشتركين فـي حافلات المدرسة توصيل أبنائهم طيلة الأسبوع التمهيدي ذهابًا وإيابًا والحضور معهم لتشجيعهم.
        لن يتم تحويل الطالب للوحدة الصحية إلا بعد تسديد الدفعة الأولى من الرسوم ؛ ليتم اعتماد تسجيل ابنكم ضمن تلاميذ المدرسة لعام الدراسي 1439 / 1440هـ .
        لن يتم قبول الطالب في برنامج نور إلا بعد إكمال الملف الورقي .
        يبدأ برنامج الأسبوع التمهيدي يوميا الساعة 7.30 صباحًا .`,
      }
    ];

    this.teamData = [
      {image:"/assets/images/quality/quality1 (5).jpg", 
      name:"المستشار عدنان بن عوض الزائدي",
      title:"المستشار",
      description:"على أولياء الأمور المشتركين فـي حافلات    "},
      {image:"/assets/images/quality/quality1 (2).jpg",
       name:"أ .أحمد صلاح النمر",
       title:"المستشار",
       description:"على أولياء الأمور المشتركين فـي حافلات المدرسة توصيل أبنائهم "},
      {image:"/assets/images/quality/quality1 (3).jpg",
       name:"أ .محمد عمر عبد السلام كشك",
       title:"المستشار"},
      {image:"/assets/images/quality/quality1 (4).jpg",
       name:"أ . السيد عبد الرحيم غلاب",
       title:"المستشار"},
      {image:"/assets/images/quality/quality1 (1).jpg",
       name:"أ .إبراهيم السيد عبد الرازق عبد الله",
       title:"المستشار"},
    ];
  }

}
