import { Component, OnInit } from '@angular/core';
import { LoaderService } from '../../shared/components/loader/loader.service';

@Component({
  selector: 'app-public-relation',
  templateUrl: './public-relation.component.html',
  styleUrls: ['./public-relation.component.css']
})
export class PublicRelationComponent implements OnInit {
  constructor(private loader: LoaderService) { }

  data;
  ngOnInit(): void {  
      
    this.loader.showLoader();
    setTimeout(() => {
      this.loader.hideLoader();
    }, 2500);
    this.data= [
      {
        img: '../../../../../assets/images/public/public1.jpg',
        primaryTitle: `تعريف 
        العلاقات العامة`,
        secondryTitle: 'تعريف العلاقات العامة بمدارس طلائع المبدعين الأهلية ',
        discription: `
        هي الانشطة التي تقوم بها إدارة المدارس من خلال مكتب العلاقات العامة وخدمة أولياء الأمور من أجل التعريف بطبيعة 
        عملها للمستفيدين بأنواعهم عن طريق استخدام مجموعة من وسائل الاتصال والإعلان المتاحة. لتطبيق رؤية ورسالة المدارس، وقياس مدى رضا 
        أولياء الأمور والمستفيدين عن مختلف الخدمات التي تقدم لها، لذلك يجمع مفهوم العلاقات العامة بين الفن، وعلم الإدارة،
         فإختيار الوسيلة المناسبة للتواصل مع الاخرين يعد نوعا من أنواع الفنون، أما دراسة آراء
         المستفيدين والتعرف عليها من أجل تطبيقها يعد علما قائما بذاته.
        `,
      },
      {
        img: '../../../../../assets/images/public/public2.jpg',
        primaryTitle: 'مهام ووظائف ',
        secondryTitle: 'مهام ووظائف العلاقات العامة في مدارس طلائع المبدعين الأهلية ',
        discription: `
        1. إعلام المستفيدين والمجتمع المحلي بالقواعد والأنظمة الخاصة بالمدارس .          
        2. تحديد ورسم سياسات المدارس بما يتفق مع مصلحة الجمهور.           
        3. تقويم الاتجاهات وقياس اتجاهات الرأي العام .
        4. تدوين البرامج التي تهدف إلى كسب رضا الجمهور ورفعها لإدارة الجودة الشاملة لاتخاذ اللازم.
        5. الحرص على تقديم الأعمال التي تحظى باحترام وثقة الجمهور .
        6. تحقيق المزيد من التعاون الخلاق والأداء الفعال باستخدام التواصل الهادف المخطط.
        7. المشاركة في حل مشكلات المجتمع والبيئة المحيطة بالمنظمة.
        8. تعريف المجتمع الخارجي بالمؤسسة وشرح رسالتها وأهدافها بلغة مبسطة سهلة الفهم للجميع.
        9. تنسيق العمل بين المدارس والجهات الخارجية.
        10. تنظيم مقابلات الإدارة العليا واستقبال الزوار والمراجعين بشكل لبق وحضاري.
        11. بحث وتحليل وتلخيص جميع المسائل التي تهم الإدارة ورفعها إليها .
        12. استقبال الضيوف الرسميين وتأمين متطلباتهم وراحتهم.
        13. إعداد النشرات الإعلامية التي تتعلق بنشاطات المدارس.
        وختامًا
        ٓيعلن مكتب العلاقات العامة وخدمة أولياء الأمور بالمدرسة أنه في خدمتكم دائما، وفي اي وقت، فلا تترددوا في الاتصال بنا، والتواصل معنا بالطريقة التي تختارونها
        `,
      }
    ];
  }

}
