import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-all-articles',
  templateUrl: './all-articles.component.html',
  styleUrls: ['./all-articles.component.css']
})
export class AllArticlesComponent implements OnInit {

  p: number = 1;
  search;
  constructor() { }
  fetchData = [
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-1.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-3.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-2.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-3.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-1.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-2.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-1.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-3.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-2.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-1.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-3.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-2.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-1.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/article-test.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-2.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"assets/images/s5.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
    {"image":"http://bestjquery.com/tutorial/hover-effect/demo118/images/img-3.jpg","description":"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميلليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه باو فلاير على سبيل المثال", "title":"لوريم ايبسوم"},
  ];
  ngOnInit(): void {
  }

}
