import { Component, OnInit } from '@angular/core';
import { LoaderService } from '../../shared/components/loader/loader.service';

@Component({
  selector: 'app-supervision',
  templateUrl: './supervision.component.html',
  styleUrls: ['./supervision.component.css']
})
export class SupervisionComponent implements OnInit {
data;
teamData;
  constructor(private loader: LoaderService) { }

  ngOnInit(): void {
     
    this.loader.showLoader();
    setTimeout(() => {
      this.loader.hideLoader();
    }, 2500);
    this.data= [
      {
        img: '../../../../../assets/images/supervision/super.jpg',
        primaryTitle: 'قسم الاشراف والتطوير المهني',
        secondryTitle: 'كلمة عن قسم الاشراف والتطوير المهني ',
        discription: `
     لتطوير المهني مفهوم شامل يتجاوز التدريب، ويقود إلى تنمية مهنية مستدامة تُفعّل فيها كل الأدوات الممكنة، وينطلق من تحديد الاحتياج الحقيقي وليس الاحتياج التدريبي.
     والتطوير المهني الحقيقي هو الذي ينبع من المدرسة، ويرتبط بحاجاتها الخاصة ويراعي التحديات التي تواجهها وطبيعة بيئتها، وتكمن أهميته في أنه يُمكن المستهدفين من القيام بمهامهم وواجباتهم؛ لمواكبة المستجدات والمستحدثات التربوية والعلمية والتقنية والإفادة منها، فأصبح التطوير المهني استثمارًا حقيقيًا لرفعة شأن أي منظمة ترغب في اللحاق بركب التقدم والتطور، وإيمانًا من مؤسس مدارس طلائع المبدعين الأهلية الأستاذ: عوض بن عواض الزائدي بالمضامين السابقة، فقد أولى هذا الأمر جلَّ عنايته فاستقطب الخبراء المتمكنين علميًا والذين صقلتهم تجارب الميدان، ووفر لهم سبل النجاح وتحقيق الأهداف.
      وحرص أن يتم التطوير المهني في مدارسه وفقًا لأسسه العلمية والعملية، بداية من تحديد الاحتياجات وتقديرها، ثم بناء وتصميم الأسلوب التطويري المناسب لتلك الاحتياجات، سواء أكان تدريبًا أو معالجةً لمشكلات التأهيل، أو دعمًا لنقص الخبرة والممارسة، ليتم بعد ذلك التنفيذ بأفضل السبل والطرق مع إلزام المستهدفين بالتطبيق والتجريب المتبوع بالتقويم وقياس الأثر، فإما تعزيز أو تعديل أو إضافة أو هندرة.
     كما أدرك العاملون على التطوير المهني بالمدارس أهمية الفروق الفردية وتنوع الاحتياجات وعملوا على بناء تطوير يأخذ في الحسبان أن الإنسان يشبه كل الناس، وأنه يشبه بعض الناس، وأنه لا يشبه أحد.
     وختامًا فقد أضحى التطوير المهني بالمدارس رحلة مستمرة وخيارًا إستراتيجيًا للاستثمار والتنمية البشرية، وتطوير الممارسات وصقل المهارات وتغيير الاتجاهات
  
        `,
      }
    ];
    this.teamData = [
      {image:"/assets/images/supervision/super1.jpg",
       name:"أ .جمال محمد عوض فرج",
       title:"المشرف    التربوي المقيم"},
      {image:"/assets/images/supervision/super2.jpg",
       name:"أ .رزق الله بن عبد الله عواض الطلخي",
       title:"المشرف التربوي المقيم للصفوف الأولية"},
      {image:"/assets/images/supervision/super3.jpg",
       name:"أ . أحمد مرشد مسعود الخديدي" ,
       title : "المشرف المقيم لمادة"},
      {image:"/assets/images/supervision/super4.jpg",
       name:"أ .رزق الله بن عبد الله عواض الطلخي",
       title:"المشرف التربوي المقيم للصفوف الأولية"},
      {image:"/assets/images/supervision/super5.jpg",
       name:"أ . أحمد مرشد مسعود الخديدي" ,
       title : "المشرف المقيم لمادة"},
    ];
  }

}
